import * as fs from 'fs'
import * as path from 'path'
/**
 * 城市信息
 */
export interface ICityInfo {
  /**
   * 省份
   */
  province: string
  /**
   * 城市
   */
  city: string
  /**
   * 区号
   */
  areaCode: string
  /**
   * 运营商
   */
  provider: string
}
/**
 * 城市信息的缓存
 */
let cityBuffer: { [key: string]: Buffer } = {}
/**
 * @file icity
 * @url https://github.com/zswang/icity.git
 * Get the tools for the city where your phone number is located
 * @author
 *   zswang (http://weibo.com/zswang)
 * @version 0.0.2
 * @date 2017-10-26
 * @license MIT
 */
/**
 * 解析手机号
 * @param phone 手机号
 * @return 返回手机所在城市信息
 * @example parse():base 13810570000 13820570000
  ```js
  console.log(JSON.stringify(icity.parse('13810570000')))
  // > {"province":"北京","city":"北京","areaCode":"010","provider":"中国移动"}
  console.log(JSON.stringify(icity.parse('13820570000')))
  // > {"province":"天津","city":"天津","areaCode":"022","provider":"中国移动"}
  ```
 * @example parse():base 15900940000
  ```js
  console.log(JSON.stringify(icity.parse('15900940000')))
  // > {"province":"上海","city":"上海","areaCode":"021","provider":"中国移动"}
  ```
 * @example parse():virtual providers
  ```js
  console.log(JSON.stringify(icity.parse('17069990000')))
  // > {"province":"辽宁","city":"沈阳","areaCode":"024","provider":"中国移动"}
  console.log(JSON.stringify(icity.parse('17070000000')))
  // > {"province":"北京","city":"北京","areaCode":"010","provider":"中国联通"}
  ```
 * @example parse():coverage
  ```js
  console.log(JSON.stringify(icity.parse()))
  // > null
  console.log(JSON.stringify(icity.parse(123)))
  // > null
  console.log(JSON.stringify(icity.parse('19900940000')))
  // > null
  ```
 */
function parse(phone: string): ICityInfo {
  if (!phone || phone.length != 11) {
    return null
  }
  phone = String(phone)
  //  012  3456
  // [131][1234][5678]
  let providerCode = phone.slice(0, 3)
  let provider = providers[providerCode] || virtualProviders[phone.slice(0, 4)]
  if (!provider) {
    return null
  }
  if (!cityBuffer[providerCode]) {
    let filename = path.join(__dirname, `../data/${providerCode}.dat`)
    cityBuffer[providerCode] = fs.readFileSync(filename)
  }
  let offset = parseInt(phone.slice(3, 7), 10) * 2
  let areaCode = cityBuffer[providerCode].readUInt16LE(offset)
  let cityInfo = citys[areaCode]
  return {
    province: cityInfo[0],
    city: cityInfo[1],
    areaCode: `0${areaCode}`,
    provider: provider,
  }
}
export {
  parse
}
// #region city
const citys: {
  [key: number]: string[]
} = {
    531: ['山东', '济南'],
    519: ['江苏', '常州'],
    565: ['安徽', '巢湖'],
    831: ['四川', '宜宾'],
    813: ['四川', '自贡'],
    29: ['陕西', '西安'],
    25: ['江苏', '南京'],
    27: ['湖北', '江汉'],
    10: ['北京', '北京'],
    22: ['天津', '天津'],
    533: ['山东', '淄博'],
    535: ['山东', '烟台'],
    21: ['上海', '上海'],
    510: ['江苏', '无锡'],
    20: ['广东', '广州'],
    771: ['广西', '南宁'],
    724: ['湖北', '荆门'],
    536: ['山东', '潍坊'],
    577: ['浙江', '温州'],
    371: ['河南', '郑州'],
    931: ['甘肃', '兰州'],
    574: ['浙江', '宁波'],
    431: ['吉林', '长春'],
    414: ['辽宁', '本溪'],
    417: ['辽宁', '营口'],
    411: ['辽宁', '大连'],
    472: ['内蒙古', '包头'],
    991: ['新疆', '乌鲁木齐'],
    454: ['黑龙江', '佳木斯'],
    451: ['黑龙江', '哈尔滨'],
    591: ['福建', '福州'],
    312: ['河北', '保定'],
    315: ['河北', '唐山'],
    335: ['河北', '秦皇岛'],
    316: ['河北', '廊坊'],
    317: ['河北', '沧州'],
    319: ['河北', '邢台'],
    310: ['河北', '邯郸'],
    318: ['河北', '衡水'],
    311: ['河北', '石家庄'],
    543: ['山东', '滨州'],
    546: ['山东', '东营'],
    539: ['山东', '临沂'],
    633: ['山东', '日照'],
    632: ['山东', '枣庄'],
    631: ['山东', '威海'],
    532: ['山东', '青岛'],
    635: ['山东', '聊城'],
    534: ['山东', '德州'],
    538: ['山东', '泰安'],
    537: ['山东', '济宁'],
    530: ['山东', '菏泽'],
    23: ['重庆', '重庆'],
    24: ['辽宁', '沈阳'],
    573: ['浙江', '嘉兴'],
    572: ['浙江', '湖州'],
    580: ['浙江', '舟山'],
    575: ['浙江', '绍兴'],
    570: ['浙江', '衢州'],
    579: ['浙江', '金华'],
    576: ['浙江', '台州'],
    578: ['浙江', '丽水'],
    634: ['山东', '莱芜'],
    834: ['四川', '凉山'],
    812: ['四川', '攀枝花'],
    817: ['四川', '南充'],
    825: ['四川', '遂宁'],
    818: ['四川', '达州'],
    830: ['四川', '泸州'],
    832: ['四川', '内江'],
    551: ['安徽', '合肥'],
    552: ['安徽', '蚌埠'],
    553: ['安徽', '芜湖'],
    554: ['安徽', '淮南'],
    511: ['江苏', '镇江'],
    518: ['江苏', '连云港'],
    515: ['江苏', '盐城'],
    527: ['江苏', '宿迁'],
    516: ['江苏', '徐州'],
    513: ['江苏', '南通'],
    517: ['江苏', '淮安'],
    571: ['浙江', '杭州'],
    594: ['福建', '莆田'],
    592: ['福建', '厦门'],
    596: ['福建', '漳州'],
    558: ['安徽', '亳州'],
    514: ['江苏', '扬州'],
    523: ['江苏', '泰州'],
    512: ['江苏', '苏州'],
    595: ['福建', '泉州'],
    598: ['福建', '三明'],
    593: ['福建', '宁德'],
    599: ['福建', '南平'],
    597: ['福建', '龙岩'],
    898: ['海南', '海口'],
    754: ['广东', '汕头'],
    660: ['广东', '汕尾'],
    663: ['广东', '揭阳'],
    753: ['广东', '梅州'],
    762: ['广东', '河源'],
    768: ['广东', '潮州'],
    763: ['广东', '清远'],
    751: ['广东', '韶关'],
    766: ['广东', '云浮'],
    755: ['广东', '深圳'],
    760: ['广东', '中山'],
    758: ['广东', '肇庆'],
    759: ['广东', '湛江'],
    662: ['广东', '阳江'],
    668: ['广东', '茂名'],
    756: ['广东', '珠海'],
    752: ['广东', '惠州'],
    750: ['广东', '江门'],
    772: ['广西', '来宾'],
    773: ['广西', '桂林'],
    775: ['广西', '贵港'],
    774: ['广西', '梧州'],
    779: ['广西', '北海'],
    791: ['江西', '南昌'],
    701: ['江西', '鹰潭'],
    793: ['江西', '上饶'],
    795: ['江西', '宜春'],
    790: ['江西', '新余'],
    799: ['江西', '萍乡'],
    833: ['四川', '乐山'],
    28: ['四川', '眉山'],
    838: ['四川', '德阳'],
    839: ['四川', '广元'],
    816: ['四川', '绵阳'],
    757: ['广东', '佛山'],
    769: ['广东', '东莞'],
    770: ['广西', '防城港'],
    776: ['广西', '百色'],
    777: ['广西', '钦州'],
    778: ['广西', '河池'],
    351: ['山西', '太原'],
    354: ['山西', '晋中'],
    792: ['江西', '九江'],
    730: ['湖南', '岳阳'],
    731: ['湖南', '长沙'],
    734: ['湖南', '衡阳'],
    735: ['湖南', '郴州'],
    736: ['湖南', '常德'],
    737: ['湖南', '益阳'],
    738: ['湖南', '娄底'],
    739: ['湖南', '邵阳'],
    379: ['河南', '洛阳'],
    372: ['河南', '安阳'],
    391: ['河南', '焦作'],
    373: ['河南', '新乡'],
    374: ['河南', '许昌'],
    395: ['河南', '漯河'],
    979: ['青海', '格尔木'],
    971: ['青海', '西宁'],
    972: ['青海', '海东'],
    974: ['青海', '海南'],
    970: ['青海', '海北'],
    851: ['贵州', '贵阳'],
    852: ['贵州', '遵义'],
    853: ['贵州', '安顺'],
    952: ['宁夏', '石嘴山'],
    953: ['宁夏', '吴忠'],
    954: ['宁夏', '固原'],
    951: ['宁夏', '银川'],
    359: ['山西', '运城'],
    357: ['山西', '临汾'],
    352: ['山西', '大同'],
    356: ['山西', '晋城'],
    355: ['山西', '长治'],
    419: ['辽宁', '辽阳'],
    418: ['辽宁', '阜新'],
    427: ['辽宁', '盘锦'],
    421: ['辽宁', '朝阳'],
    416: ['辽宁', '锦州'],
    913: ['陕西', '渭南'],
    916: ['陕西', '汉中'],
    917: ['陕西', '宝鸡'],
    919: ['陕西', '铜川'],
    911: ['陕西', '延安'],
    873: ['云南', '红河'],
    878: ['云南', '楚雄'],
    874: ['云南', '曲靖'],
    877: ['云南', '玉溪'],
    871: ['云南', '昆明'],
    434: ['吉林', '四平'],
    437: ['吉林', '辽源'],
    438: ['吉林', '松原'],
    436: ['吉林', '白城'],
    439: ['吉林', '白山'],
    433: ['吉林', '延边'],
    432: ['吉林', '吉林'],
    435: ['吉林', '通化'],
    415: ['辽宁', '丹东'],
    429: ['辽宁', '葫芦岛'],
    412: ['辽宁', '鞍山'],
    471: ['内蒙古', '呼和浩特'],
    474: ['内蒙古', '乌兰察布'],
    477: ['内蒙古', '鄂尔多斯'],
    478: ['内蒙古', '巴彦淖尔'],
    473: ['内蒙古', '乌海'],
    994: ['新疆', '昌吉'],
    452: ['黑龙江', '齐齐哈尔'],
    453: ['黑龙江', '牡丹江'],
    459: ['黑龙江', '大庆'],
    455: ['黑龙江', '绥化'],
    456: ['黑龙江', '黑河'],
    467: ['黑龙江', '鸡西'],
    464: ['黑龙江', '七台河'],
    468: ['黑龙江', '鹤岗'],
    469: ['黑龙江', '双鸭山'],
    555: ['安徽', '马鞍山'],
    563: ['安徽', '宣城'],
    556: ['安徽', '安庆'],
    550: ['安徽', '滁州'],
    566: ['安徽', '池州'],
    559: ['安徽', '黄山'],
    562: ['安徽', '铜陵'],
    872: ['云南', '大理'],
    888: ['云南', '丽江'],
    557: ['安徽', '宿州'],
    564: ['安徽', '六安'],
    561: ['安徽', '淮北'],
    937: ['甘肃', '酒泉'],
    936: ['甘肃', '张掖'],
    935: ['甘肃', '武威'],
    470: ['内蒙古', '呼伦贝尔'],
    475: ['内蒙古', '通辽'],
    476: ['内蒙古', '赤峰'],
    856: ['贵州', '铜仁'],
    855: ['贵州', '黔东南'],
    854: ['贵州', '黔南'],
    858: ['贵州', '六盘水'],
    859: ['贵州', '黔西南'],
    857: ['贵州', '毕节'],
    375: ['河南', '平顶山'],
    313: ['河北', '张家口'],
    314: ['河北', '承德'],
    797: ['江西', '赣州'],
    912: ['陕西', '榆林'],
    943: ['甘肃', '白银'],
    932: ['甘肃', '定西'],
    930: ['甘肃', '临夏'],
    993: ['新疆', '石河子'],
    996: ['新疆', '库尔勒'],
    998: ['新疆', '喀什'],
    393: ['河南', '濮阳'],
    398: ['河南', '三门峡'],
    392: ['河南', '鹤壁'],
    482: ['内蒙古', '兴安盟'],
    479: ['内蒙古', '锡林郭勒盟'],
    798: ['江西', '景德镇'],
    796: ['江西', '吉安'],
    794: ['江西', '抚州'],
    995: ['新疆', '吐鲁番'],
    902: ['新疆', '哈密'],
    997: ['新疆', '阿克苏'],
    992: ['新疆', '奎屯'],
    909: ['新疆', '博乐'],
    999: ['新疆', '伊犁'],
    990: ['新疆', '克拉玛依'],
    717: ['湖北', '宜昌'],
    718: ['湖北', '恩施'],
    876: ['云南', '文山'],
    879: ['云南', '普洱'],
    875: ['云南', '保山'],
    350: ['山西', '忻州'],
    349: ['山西', '朔州'],
    358: ['山西', '吕梁'],
    376: ['河南', '信阳'],
    396: ['河南', '驻马店'],
    394: ['河南', '周口'],
    934: ['甘肃', '庆阳'],
    938: ['甘肃', '天水'],
    933: ['甘肃', '平凉'],
    714: ['湖北', '黄石'],
    711: ['湖北', '鄂州'],
    713: ['湖北', '黄冈'],
    745: ['湖南', '怀化'],
    712: ['湖北', '孝感'],
    722: ['湖北', '随州'],
    710: ['湖北', '襄阳'],
    719: ['湖北', '十堰'],
    716: ['湖北', '荆州'],
    728: ['湖北', '仙桃'],
    883: ['云南', '临沧'],
    886: ['云南', '怒江'],
    692: ['云南', '德宏'],
    691: ['云南', '西双版纳'],
    715: ['湖北', '咸宁'],
    744: ['湖南', '张家界'],
    746: ['湖南', '永州'],
    353: ['山西', '阳泉'],
    743: ['湖南', '吉首'],
    370: ['河南', '商丘'],
    377: ['河南', '南阳'],
    914: ['陕西', '商洛'],
    887: ['云南', '迪庆'],
    870: ['云南', '昭通'],
    915: ['陕西', '安康'],
    458: ['黑龙江', '伊春'],
    457: ['黑龙江', '大兴安岭'],
    908: ['新疆', '克州'],
    903: ['新疆', '和田'],
    901: ['新疆', '塔城'],
    906: ['新疆', '阿勒泰'],
    836: ['四川', '甘孜'],
    837: ['四川', '阿坝'],
    827: ['四川', '巴中'],
    826: ['四川', '广安'],
    835: ['四川', '雅安'],
    483: ['内蒙古', '阿拉善盟'],
    941: ['甘肃', '甘南'],
    939: ['甘肃', '陇南'],
    976: ['青海', '玉树'],
    975: ['青海', '果洛'],
    973: ['青海', '黄南'],
    955: ['宁夏', '中卫'],
    891: ['西藏', '拉萨'],
    892: ['西藏', '日喀则'],
    893: ['西藏', '山南'],
    894: ['西藏', '林芝'],
    895: ['西藏', '昌都'],
    896: ['西藏', '那曲'],
    897: ['西藏', '阿里'],
    977: ['青海', '德令哈'],
  }
// #endregion
// #region provider
const providers: {
  [key: number]: string
} = {
    130: '中国联通',
    131: '中国联通',
    132: '中国联通',
    133: '中国电信',
    134: '中国移动',
    135: '中国移动',
    136: '中国移动',
    137: '中国移动',
    138: '中国移动',
    139: '中国移动',
    145: '中国联通',
    147: '中国移动',
    149: '中国电信',
    150: '中国移动',
    151: '中国移动',
    152: '中国移动',
    153: '中国电信',
    155: '中国联通',
    156: '中国联通',
    157: '中国移动',
    158: '中国移动',
    159: '中国移动',
    171: '中国联通',
    172: '中国移动',
    173: '中国电信',
    175: '中国联通',
    176: '中国联通',
    177: '中国电信',
    178: '中国移动',
    180: '中国电信',
    181: '中国电信',
    182: '中国移动',
    183: '中国移动',
    184: '中国移动',
    185: '中国联通',
    186: '中国联通',
    187: '中国移动',
    188: '中国移动',
    189: '中国电信',
  }
// #endregion
// #region virtual providers
const virtualProviders: {
  [key: number]: string
} = {
    1700: '中国电信',
    1701: '中国电信',
    1702: '中国电信',
    1703: '中国移动',
    1705: '中国移动',
    1706: '中国移动',
    1707: '中国联通',
    1708: '中国联通',
    1709: '中国联通',
  }
// #endregion